/**
 * npm 脚本生命周期
 */

const TARGET = process.env.npm_lifecycle_event;
const NAME = process.env.npm_package_name;

if (TARGET === "prebuild") {
  console.log(`
...   停机信号插拴抽出完毕     ...\n
...        驾驶舱插入        ...\n
...      驾驶舱固定终了       ...\n
...      开始第一次接触       ...\n
...  将水（LCL）注入驾驶舱     ...\n
... 主电源接续动力传达所有回路  ...\n
...      进入第二次接触       ...\n
...     A10神经接续无异常     ...\n
...      思考形态改为中文     ...\n
...        双向回路开启      ...\n
...         同步率97%       ...\n
...调和率都在正常值没有失控现象 ...\n
...         准备出动         ...\n
...       第一固定锁解除      ...\n
...         确认解除         ...\n
...       第二固定锁解除      ...\n
...     手臂固定器开始移动     ...\n
...  从1号到15号安全装置解除   ...\n
...      内部电源充电完毕      ...\n
...     外部电源插头无异状     ...\n
...       初号机准备出发      ...\n
...         清除通道         ...\n
...         完全无阻         ...\n
...     出击准备全部完成      ...\n
...       初号机，出动!      ...\n
    `);
}

if (TARGET === "postbuild") {
  console.log('初号机弹射成功')
  console.log(`真嗣，今天也要振作啊`);
}
